backend/app/models/profile.rb

UPDATE "profiles" SET "balance" = ? WHERE "profiles"."id" = ?  [["balance", 20.0], ["id", 1]]
UPDATE "profiles" SET "balance" = ? WHERE "profiles"."id" = ?  [["balance", 20.0], ["id", 6]]
---
def update_balance(activity)
    if activity.kind == 'deposit'
        self.balance = self.balance + activity.amount
        self.save
    elsif activity.kind == 'debit'
        if self.balance >= activity.amount
          self.balance = self.balance - activity.amount
          self.save

UPDATE "profiles" SET "balance" = ? WHERE "profiles"."id" = ?  [["balance", 0.0], ["id", 1]]
UPDATE "profiles" SET "balance" = ? WHERE "profiles"."id" = ?  [["balance", 40.0], ["id", 1]]
---
def update_balance_on_delete(activity)
    if activity.kind == 'deposit'
      if self.balance >= activity.amount
        self.balance = self.balance - activity.amount
        self.save
        else
            return 'Balance too low'
        end
    elsif
        activity.kind == 'debit'
        self.balance = self.balance + activity.amount
        self.save