backend/app/controllers/api/v1/activities_controller.rb

    def create
      @activity = @profile.activities.new(activity_params)

      @activity.date = DateTime.now
      if @profile.update_balance(@activity) != 'Balance too low.'
        @activity.save
---
INSERT INTO "activities" ("profile_id", "amount", "kind", "date") VALUES (?, ?, ?, ?)  [["profile_id", 1], ["amount", 20.0], ["kind", "deposit"], ["date", "2020-04-30 05:01:33.638271"]]

    def destroy
      @activity = Activity.find(params["id"])
      @profile = Profile.find(@activity.profile_id)
      if @profile.update_balance_on_delete(@activity)
        @activity.destroy
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "activities".* FROM "activities" WHERE "activities"."profile_id" = ?  [["profile_id", 1]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "profiles" SET "balance" = ? WHERE "profiles"."id" = ?  [["balance", 0.0], ["id", 1]]
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 1]]

    def set_profile
      @profile = Profile.find(params[:profile_id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]