backend/app/controllers/api/v1/profiles_controller.rb

INSERT INTO "profiles" ("name", "balance", "debt") VALUES (?, ?, ?)  [["name", "School Debt 2020"], ["balance", 0.0], ["debt", 150.0]]
---
    def create
      @profile = Profile.new(profile_params)
      if @profile.save

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "profiles" SET "name" = ?, "debt" = ? WHERE "profiles"."id" = ?  [["name", "silo_adjacent2"], ["debt", nil], ["id", 1]]
UPDATE "profiles" SET "debt" = ? WHERE "profiles"."id" = ?  [["debt", 150.0], ["id", 1]]
---
    def update
      @profile = Profile.find(params[:id])
      @profile.update(name: params["profile"]["name"])
      @profile.save